=> 0x20001000:  lui     sp,0x20100        ; sp = 0x20100000
   0x20001004:  addi    sp,sp,-4          ; sp = 0x200ffffc
   0x20001008:  jal     ra,0x2000106c

   0x2000100c:  lui     a0,0x20001
   0x20001010:  jr      a0
   0x20001014:  j       0x20001018

label 0x20001018:
   0x20001018:  lui     a5,0x20001
   0x2000101c:  lui     a4,0x20001
   0x20001020:  lw      a5,1176(a5)
   0x20001024:  lw      a7,1180(a4)
   0x20001028:  li      a2,28
   0x2000102c:  li      a6,9
   0x20001030:  li      a1,-4
   0x20001034:  srl     a4,a0,a2
   0x20001038:  andi    a4,a4,15
   0x2000103c:  li      a3,48
   0x20001040:  bge     a6,a4,0x20001048
   0x20001044:  li      a3,87
   0x20001048:  add     a3,a3,a4
   0x2000104c:  lw      a4,0(a5)
   0x20001050:  beqz    a4,0x2000104c
   0x20001054:  sw      a3,0(a7)
   0x20001058:  lw      a4,0(a5)
   0x2000105c:  beqz    a4,0x20001058
   0x20001060:  addi    a2,a2,-4
   0x20001064:  bne     a2,a1,0x20001034
   0x20001068:  ret

   0x2000106c:  lui     a5,0x20001        ; 就是程序起始地址 0x20001000
   0x20001070:  lw      a5,1172(a5)       ; a5 = *(a5+1172) = 0x93000004     ; 奇怪的东西1
   0x20001074:  lui     a4,0x20001
   0x20001078:  lw      a0,1160(a4)       ; a0 = 0x92000000     ; 奇怪的东西2
   0x2000107c:  addi    sp,sp,-48         ; 抬栈 sp = 0x200fffcc
   0x20001084:  sw      s1,36(sp)
   0x20001080:  sw      s0,40(sp)         ; 保存栈帧
   0x20001088:  sw      ra,44(sp)         ; 保存返回地址
   0x2000108c:  li      a4,1              ; a4 = 1
   0x20001090:  sw      a4,0(a5)          ; 0x93000004 = 1
   0x20001094:  li      a5,-1             ; a5 = -1
   0x20001098:  sw      a5,24(a0)         ; 0x92000018 = -1
   0x2000109c:  lui     s1,0x20001        ; saved reg = 0x20001
   0x200010a0:  lui     s0,0x20001        ; fp = 0x20001
   0x200010a4:  sw      a5,28(a0)         ; 0x9200001c = -1
   0x200010a8:  lw      a4,1176(s1)       ; a4 = 0x93000008    ; 奇怪的东西3
   0x200010ac:  lw      a6,1180(s0)       ; a6 = 0x93000000    ; 奇怪的东西4
   0x200010b0:  sw      a5,32(a0)         ; 0x92000020 = -1

   0x200010b4:  lui     a3,0x20001
   0x200010b8:  sw      a5,36(a0)         ; 0x92000024 = -1        
   0x200010bc:  addi    a3,a3,1093        ; a3 -> "ED: ON..."
   0x200010c0:  li      a2,76             ; a2 = 76 -> 'L'

   0x200010c4:  lw      a5,0(a4)          ; 从 0x93000008 读取到a5         ; 估计是串口ok的标识位
   0x200010c8:  beqz    a5,0x200010c4     ; if a5 == 0 goto 0x200010c4
   0x200010cc:  sw      a2,0(a6)          ; 0x93000000 = a2初始值'L' 然后是 "ED: ON"   ; 很明显这是打印到串口

   0x200010d0:  lw      a5,0(a4)          ; 从 0x93000008 读到a5
   0x200010d4:  beqz    a5,0x200010d0     ; 串口ok的标识位
   
   0x200010d8:  addi    a3,a3,1           ; a3 + 1-> "D: ON.."
   0x200010dc:  lbu     a2,-1(a3)         ; a2 - 1 -> 'ED: ON.."
   0x200010e0:  bnez    a2,0x200010c4     ; 循环打印字符

   0x200010e4:  li      a5,0
   0x200010e8:  lui     a1,0x20100        ; a1 = 0x20100000
   0x200010ec:  lui     a2,0x4            ; a2 = 0x4000
   
   0x200010f0:  add     a3,a1,a5          ; a3 = a1 + a5 = 0x20100000
   0x200010f4:  sw      a5,0(a3)          ; 0x20100000 = 0  0x20100004 = 4 ... 0x20103ffc = 0x3ffc
   0x200010f8:  addi    a5,a5,4           ; a5 = a5 + 4
   0x200010fc:  bne     a5,a2,0x200010f0  ; 要循环0x4000/0x4=0x1000次 4096次

   0x20001100:  lui     a3,0x20001        ; a3 = 0x20100000
   0x20001104:  addi    a3,a3,1105        ; a3 = a3 + 1105 = 0x20100451 => "Memory: "
   0x20001108:  li      a2,77             ; a2 = 77 = 'M'
   0x2000110c:  lw      a5,0(a4)          ; 从 0x93000008 读到a5             ; 估计是串口ok的标识位
   0x20001110:  beqz    a5,0x2000110c
   0x20001114:  sw      a2,0(a6)          ; 0x93000000 = a2初始值'M' 然后是 "emory: "   ; 很明显这是打印到串口
   0x20001118:  lw      a5,0(a4)          ; 从 0x93000008 读到a5             ; 估计是串口ok的标识位
   0x2000111c:  beqz    a5,0x20001118
   0x20001120:  addi    a3,a3,1           ; a3 = a3 + 1 => "emory: "
   0x20001124:  lbu     a2,-1(a3)
   0x20001128:  bnez    a2,0x2000110c     ; 循环打印字符

   0x2000112c:  li      a5,0
   0x20001130:  lui     a2,0x20100        ; a2 = 0x20100000
   0x20001134:  lui     a3,0x4            ; a3 = 0x4000
   0x20001138:  j       0x20001144

label 0x2000113c:
   0x2000113c:  addi    a5,a5,4           ; a5 = a5 + 4
   0x20001140:  beq     a5,a3,0x20001164  ; if a5 == 0x4000

label 0x20001144:
   0x20001144:  add     a1,a2,a5          ; a1 = a2 + a5 = 0x20100000 .. 
   0x20001148:  lw      a1,0(a1)          ; a1 = 0 4 8 ... 0x3ffc
   0x2000114c:  beq     a1,a5,0x2000113c  ; 验证内存的

   0x20001150:  sw      zero,24(a0)
   0x20001154:  sw      zero,28(a0)
   0x20001158:  sw      zero,32(a0)
   0x2000115c:  sw      zero,36(a0)
   0x20001160:  j       0x20001160


   0x20001164:  lui     a5,0x20001        ; a5 = 0x20001000
   0x20001168:  addi    a5,a5,1117
   0x2000116c:  li      a3,79
   0x20001170:  lw      a2,0(a4)
   0x20001174:  beqz    a2,0x20001170
   0x20001178:  sw      a3,0(a6)
   0x2000117c:  lw      a3,0(a4)
   0x20001180:  beqz    a3,0x2000117c
   0x20001184:  addi    a5,a5,1
   0x20001188:  lbu     a3,-1(a5)
   0x2000118c:  bnez    a3,0x20001170     ; 循环打印OK


   0x20001190:  lui     a5,0x20001        ; a5 = 0x20001000
   0x20001194:  lw      a0,1156(a5)       ; a0 = [a5 + 1156] = 0x94000000        ; 奇怪的东西5
   0x20001198:  lui     a5,0x25           ; a5 = 0x25000   
   0x2000119c:  addi    a5,a5,2044        ; a5 = a5 + 2044 = 257fc
   0x200011a0:  mv      t4,a0             ; t4 = 0x94000000
   0x200011a4:  add     a5,a0,a5          ; a5 = a0 + a5 = 0x940257fc
   0x200011a8:  mv      a4,a0             ; a4 = a0 = 0x94000000
   0x200011ac:  sw      zero,0(a4)        ; 清空 0x94000000
   0x200011b0:  addi    a4,a4,4           ; a4 = a4 + 4 = 0x94000004
   0x200011b4:  bne     a5,a4,0x200011ac  ; 直到0x940257fc全部被为止清空

   0x200011b8:  lui     a5,0x20001        ; a5 = 0x20001000
   0x200011bc:  addi    a5,a5,1060        ; a5 = a5 + 1060 = 0x20001424
   0x200011c0:  lw      t3,0(a5)          ; t3 = [0x20001424] = 0
   0x200011c4:  lw      t1,4(a5)          ; t1 = [0x20001428] = 0x3
   0x200011c8:  lw      a6,12(a5)         ; a6 = 0x1c
   0x200011cc:  lw      a7,8(a5)          ; a7 = 0xe0
   0x200011d0:  lw      a1,16(a5)         ; a1 = 0x1f = 31
   0x200011d4:  lw      a2,20(a5)         ; a2 = 0xe3
   0x200011d8:  lw      a3,24(a5)         ; a3 = 0xfc
   0x200011dc:  lw      a4,28(a5)         ; a4 = 0xff
   0x200011e0:  lui     a5,0xff0          ; a5 = 0xff0000
   0x200011e4:  add     a5,a0,a5          ; a5 = 0x94ff0000
   0x200011e8:  sw      t3,0(sp)          ; 0x200fffcc = 0
   0x200011ec:  sw      t1,4(sp)          ; 0x200fffcc + 4 = 0x3 = 3
   0x200011f8:  sw      a7,8(sp)          ; 0x200fffcc + 8 = 0xe0 = 224
   0x200011f0:  sw      a6,12(sp)         ; 0x200fffcc + 12 = 0x1c = 28
   0x200011fc:  sw      a1,16(sp)         ; 0x200fffcc + 16 = 0x1f = 31
   0x20001200:  sw      a2,20(sp)         ; 0x200fffcc + 20 = 0xe3 = 227
   0x20001204:  sw      a3,24(sp)         ; 0x200fffcc + 24 = 0xfc = 252
   0x20001208:  sw      a4,28(sp)         ; 0x200fffcc + 28 = 0xff = 255
   
   0x200011f4:  sw      zero,0(a5)        ; 0x94ff0000 = 0
   0x2000120c:  neg     a0,a0             ; a0 = 0x6c000000
   0x20001210:  li      t3,0              ; t3 = 0
   0x20001214:  li      t6,40             ; t6 = 0x28 = 40
   0x20001218:  li      a6,59             ; a6 = 0x3b = 59
   0x2000121c:  li      t1,119            ; t1 = 0x77 = 119
   0x20001220:  li      t5,320            ; t5 = 0x140 = 320

   0x20001224:  div     a7,t3,t6          ; a7 = t3 / t6
   0x20001228:  addi    a5,sp,32          ; a5 = sp + 32 = 0x200fffec 降栈
   0x2000122c:  mv      a2,t4             ; a2 = 0x94000000
   0x20001230:  li      a1,0              ; a1 = 0
   0x20001234:  slli    a7,a7,0x2         ; a7 = 0
   0x20001238:  add     a7,a5,a7          ; a7 = a5 + 0 = 0x200fffec

   0x2000123c:  j       0x2000127c
   0x20001240:  lw      a4,-32(a7)
   0x20001244:  srai    a5,a4,0x1f
   0x20001248:  srli    a3,a5,0x18
   0x2000124c:  add     a5,a4,a3
   0x20001250:  zext.b  a5,a5
   0x20001254:  sub     a5,a5,a3
   0x20001258:  slli    a4,a5,0x8
   0x2000125c:  add     a4,a4,a5
   0x20001260:  slli    a3,a5,0x10
   0x20001264:  add     a4,a4,a3
   0x20001268:  slli    a5,a5,0x18
   0x2000126c:  add     a5,a4,a5
   0x20001270:  sw      a5,0(a2)

   0x20001274:  addi    a1,a1,1
   0x20001278:  addi    a2,a2,4

label 0x2000127c:
   0x2000127c:  add     a4,a0,a2          ; a4 = a0 + a2 = 0x6c000000 + 0x94000000 = 0x0
   0x20001280:  srai    a5,a4,0x1f        ; 右移指令 a5 = a4 >> 0x1f
   0x20001284:  srli    a3,a5,0x18        ; 左移指令 a3 = a5 << 0x18 = a4 >> 0x1f << 0x18 = a4 >> 0x7
   0x20001288:  add     a5,a4,a3          ; a5 = a4 + a3
   0x2000128c:  zext.b  a5,a5
   0x20001290:  sub     a5,a5,a3          ; a5 = a5 - a3
   0x20001294:  slli    a4,a5,0x8
   0x20001298:  add     a4,a4,a5          ; a4 = a4 + a5
   0x2000129c:  slli    a3,a5,0x10
   0x200012a0:  add     a4,a4,a3          ; a4 = a4 + a3
   0x200012a4:  slli    a5,a5,0x18        ; 
   0x200012a8:  add     a5,a4,a5          ; a5 = a4 + a5
   0x200012ac:  bgeu    a6,a1,0x20001240
   0x200012b0:  sw      a5,0(a2)          ; 将a5 写入到0x94000000中 奇怪的东西 估计是视频
   0x200012b4:  bne     a1,t1,0x20001274  ; 直到a1 = 119时才继续走 写了119个a5
   0x200012b8:  addi    t3,t3,1           ; t3 = 1
   0x200012bc:  addi    a0,a0,-478        ; a0 = a0 - 478 = 0x6c000000 - 478 = 0x6bfffe22
   0x200012c0:  addi    t4,t4,480         ; t4 = t4 + 480 = 0x94000000 + 480 = 0x940001e0
   0x200012c4:  bne     t3,t5,0x20001224  ; 直到t3 = 320时才继续往下走

   0x200012c8:  lw      a4,1176(s1)       ; a4 = [0x20100510] = 0
   0x200012cc:  lw      a2,1180(s0)       ; a2 = [0x2000149c] = 0x93000000
   0x200012d0:  lui     a5,0x20001        ; a5 = 0x20001000
   0x200012d4:  addi    a5,a5,1125        ; a5 = 0x20001465
   0x200012d8:  li      a3,86             ; 输出video outputed
   0x200012dc:  lw      a1,0(a4)
   0x200012e0:  beqz    a1,0x200012dc
   0x200012e4:  sw      a3,0(a2)
   0x200012e8:  lw      a3,0(a4)
   0x200012ec:  beqz    a3,0x200012e8
   0x200012f0:  addi    a5,a5,1
   0x200012f4:  lbu     a3,-1(a5)
   0x200012f8:  bnez    a3,0x200012dc


   0x200012fc:  lui     a5,0x20001        ; a5 = 0x20001000
   0x20001300:  addi    a5,a5,1145        ; a5 = 0x20001479
   0x20001304:  li      a3,102
   0x20001308:  lw      a1,0(a4)
   0x2000130c:  beqz    a1,0x20001308
   0x20001310:  sw      a3,0(a2)
   0x20001314:  lw      a3,0(a4)
   0x20001318:  beqz    a3,0x20001314
   0x2000131c:  addi    a5,a5,1
   0x20001320:  lbu     a3,-1(a5)
   0x20001324:  bnez    a3,0x20001308     ; 输出flag{


   0x20001328:  lui     a0,0x20001
   0x2000132c:  addi    a0,a0,24          ; a0 = a0 + 24 = 0x20001018
   0x20001330:  jal     ra,0x20001018     ; 输出flag中间的部分 20001018

   0x20001334:  lui     a0,0x20001
   0x20001338:  lui     a5,0xdeadc
   0x2000133c:  addi    a5,a5,-273
   0x20001340:  addi    a0,a0,108
   0x20001344:  xor     a0,a0,a5
   0x20001348:  jal     ra,0x20001018     ; 输出flag中间的部分 feadae83
   0x2000134c:  li      a0,224
   0x20001350:  jal     ra,0x20001018     ; 输出flag中间的部分 000000e0
   0x20001354:  lw      a3,1176(s1)
   0x20001358:  lw      a2,1180(s0)
   
   0x2000135c:  lui     a5,0x20001
   0x20001360:  addi    a5,a5,1153
   0x20001364:  li      a4,125
   0x20001368:  lw      a1,0(a3)
   0x2000136c:  beqz    a1,0x20001368
   0x20001370:  sw      a4,0(a2)
   0x20001374:  lw      a4,0(a3)
   0x20001378:  beqz    a4,0x20001374
   0x2000137c:  addi    a5,a5,1
   0x20001380:  lbu     a4,-1(a5)
   0x20001384:  bnez    a4,0x20001368     ; 输出 }


   0x20001388:  j       0x20001388


   0x2000138c:  lui     a5,0x20001        ; a5 = 0x93000004
   0x20001390:  lw      a4,1168(a5)
   0x20001394:  lw      a5,0(a4)
   0x20001398:  beqz    a5,0x20001394
   0x2000139c:  lui     a5,0x20001
   0x200013a0:  lw      a4,1164(a5)
   0x200013a4:  lui     a5,0x20001
   0x200013a8:  lw      a5,1172(a5)
   0x200013ac:  lw      a0,0(a4)
   0x200013b0:  li      a4,1
   0x200013b4:  sw      a4,0(a5)
   0x200013b8:  zext.b  a0,a0
   0x200013bc:  ret


   0x200013c0:  lui     a5,0x20001
   0x200013c4:  lw      a5,1176(a5)
   0x200013c8:  lw      a4,0(a5)
   0x200013cc:  beqz    a4,0x200013c8
   0x200013d0:  lui     a4,0x20001
   0x200013d4:  lw      a4,1180(a4)
   0x200013d8:  sw      a0,0(a4)
   0x200013dc:  lw      a4,0(a5)
   0x200013e0:  beqz    a4,0x200013dc
   0x200013e4:  ret
   0x200013e8:  lbu     a3,0(a0)
   0x200013ec:  lui     a5,0x20001
   0x200013f0:  lui     a4,0x20001
   0x200013f4:  lw      a5,1176(a5)
   0x200013f8:  lw      a2,1180(a4)
   0x200013fc:  beqz    a3,0x20001420
   0x20001400:  lw      a4,0(a5)
   0x20001404:  beqz    a4,0x20001400
   0x20001408:  sw      a3,0(a2)
   0x2000140c:  lw      a4,0(a5)
   0x20001410:  beqz    a4,0x2000140c
   0x20001414:  addi    a0,a0,1
   0x20001418:  lbu     a3,0(a0)
   0x2000141c:  bnez    a3,0x20001400
   0x20001420:  ret



   0x20001424:  unimp
   0x20001426:  unimp
   0x20001428:  lb      zero,0(zero) # 0x0
   0x2000142c:  addi    s0,sp,76
   0x2000142e:  unimp
   0x20001430:  .2byte  0x1c
   0x20001432:  unimp
   0x20001434:  .byte   0x1f, 0x00, 0x00, 0x00, 0xe3, 0x00
   0x2000143a:  unimp
   0x2000143c:  addi    a5,sp,76
   0x2000143e:  unimp
   0x20001440:  .2byte  0xff
   0x20001442:  unimp
   0x20001444:  lw      a1,12(a0)
   0x20001446:  fld     fs1,176(a2)
   0x20001448:  lw      s0,88(a4)
   0x2000144a:  slli    s10,s10,0x13
   0x2000144c:  c.slli  zero,0x2
   0x2000144e:  unimp
   0x20001450:  lui     a0,0x13
   0x20001452:  lui     t5,0x1b
   0x20001454:  flw     fs2,60(sp)
   0x20001456:  fld     ft0,392(sp)
   0x20001458:  unimp
   0x2000145a:  unimp
   0x2000145c:  fnmadd.d        fs6,fs10,ft0,ft1,rmm
   0x20001460:  unimp
   0x20001462:  unimp
   0x20001464:  flw     fs2,84(sp)
   0x20001466:  flw     fs1,76(a0)
   0x20001468:  j       0x800f2bbe
   0x2000146c:  flw     fa3,100(s0)
   0x2000146e:  lui     s0,0xffffd
   0x20001470:  lui     s0,0x19
   0x20001472:  addi    s4,s4,3
   0x20001474:  unimp
   0x20001476:  unimp
   0x20001478:  flw     fs8,88(sp)
   0x2000147a:  lui     a4,0x18
   0x2000147c:  .4byte  0x7b
   0x20001480:  addi    s10,s10,31
   0x20001482:  c.slli  zero,0x2
   0x20001484:  unimp
   0x20001486:  .2byte  0x9400
   0x20001488:  unimp
   0x2000148a:  .2byte  0x9200
   0x2000148c:  unimp
   0x2000148e:  .2byte  0x9300
   0x20001490:  .2byte  0x4
   0x20001492:  .2byte  0x9300
   0x20001494:  .2byte  0x4
   0x20001496:  .2byte  0x9300
   0x20001498:  .2byte  0x8
   0x2000149a:  .2byte  0x9300
   0x2000149c:  unimp
   0x2000149e:  .2byte  0x9300
   0x200014a0:  unimp
   0x200014a2:  unimp
   0x200014a4:  unimp
   0x200014a6:  unimp
   0x200014a8:  unimp
   0x200014aa:  unimp
   0x200014ac:  unimp
   0x200014ae:  unimp
   0x200014b0:  unimp
   0x200014b2:  unimp
   0x200014b4:  unimp
   0x200014b6:  unimp
   0x200014b8:  unimp
   0x200014ba:  unimp
   0x200014bc:  unimp
   0x200014be:  unimp
   0x200014c0:  unimp
   0x200014c2:  unimp
   0x200014c4:  unimp
   0x200014c6:  unimp
   0x200014c8:  unimp